r1 = map (+3) [ 1,2,3,4]

-- [ "Hi Kim", "Hi Lee", "Hi Park"]
r2 = map ("Hi " ++ ) ["Kim", "Lee", "Park"]


-- [1,3,5]
r3 = map fst [ (1,2),(3,4), (5,6)]

-- replicate 3 3,replicate 3 4
-- [[3,3,3],[4,4,4],[5,5,5],[6,6,6]]
r4 = map (replicate 3) [3..6]

-- [1,3,5]
r5 = map head [[1,2],[3,4],[5,6]]

-- map      : 인자가 2개.
-- map (*2) : 인자가 한개. 리스트
--          : 인자로 전달된 리스트의 각 요소의 값을 2배로

-- [[2,4], [6,8],[5,10]]
r6 = map ( map (*2)) [[1,2],[3,4],[5,6]]




















--
